<a href="https://colab.research.google.com/github/ikeyada/Fast-Campus-LOP/blob/master/200909_Week1_Sample_6_ipynb%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [60]:
import io
import pandas as pd

from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [61]:
filename = '/content/drive/My Drive/Sample_6 Item.csv'
data = pd.read_csv(filename)
data.head()

        월  항목           국가      지역   Value
0  201903  11  보스니아-헤르체고비나  충남 천안시  0.2110
1  201903  11           중국  경기 성남시  0.6500
2  201903  11           대만  서울 송파구  0.0003
3  201903  11         이탈리아  서울 노원구  0.2030
4  201903  11     도미니카 공화국  충남 천안시  0.1708

In [4]:
print(data.shape)

(9685, 5)

In [7]:
data['지역'].isin(["강원 춘천시"])

0       False
1       False
2       False
3       False
4       False
        ...
9680    False
9681    False
9682    False
9683    False
9684    False
Name: 지역, Length: 9685, dtype: bool

In [8]:
data[data['지역'].isin(["강원 춘천시"])]

           월  항목         국가      지역   Value
323   201905  11         미국  강원 춘천시  0.7917
463   201907  11         미국  강원 춘천시  0.8603
817   201910  11         미국  강원 춘천시  1.6459
991   202001  11         미국  강원 춘천시  0.8549
1109  202002  11         미국  강원 춘천시  0.5765
...      ...  ..        ...     ...     ...
5430  202006  33        몰디브  강원 춘천시  0.3182
5431  202006  33  아랍에미리트 연합  강원 춘천시  0.0003
5432  202006  33         인도  강원 춘천시  1.3429
5437  202006  33         말리  강원 춘천시  0.1306
5440  202006  33        바레인  강원 춘천시  0.0167

[1487 rows x 5 columns]

In [10]:
data[data['지역'].isin(["강원 춘천시","경기 용인시"])]

           월  항목       국가      지역    Value
5     201903  11     파키스탄  경기 용인시   0.0938
14    201903  11      세네갈  경기 용인시   0.0181
19    201903  11  사우디아라비아  경기 용인시   0.5779
35    201903  11     이탈리아  경기 용인시   0.0633
51    201903  11     루마니아  경기 용인시   0.0285
...      ...  ..      ...     ...      ...
9586  202005  66       중국  경기 용인시  11.7183
9627  202006  66      베트남  경기 용인시   0.0013
9642  202006  66       미국  경기 용인시  27.7205
9645  202006  66       인도  경기 용인시   6.1316
9676  202006  66       홍콩  경기 용인시   4.1862

[2026 rows x 5 columns]

In [12]:
data[data['항목'].isin(["11"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])]

           월  항목       국가      지역   Value
5     201903  11     파키스탄  경기 용인시  0.0938
14    201903  11      세네갈  경기 용인시  0.0181
19    201903  11  사우디아라비아  경기 용인시  0.5779
35    201903  11     이탈리아  경기 용인시  0.0633
51    201903  11     루마니아  경기 용인시  0.0285
...      ...  ..      ...     ...     ...
1868  202006  11    카자흐스탄  경기 용인시  8.9789
1870  202006  11       태국  경기 용인시  0.2296
1871  202006  11      프랑스  경기 용인시  0.0153
1874  202006  11     이탈리아  경기 용인시  0.2356
1900  202006  11       페루  경기 용인시  0.0188

[144 rows x 5 columns]

In [21]:
data[data['항목'].isin(["11","22","33","44","55","66"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])]

           월  항목       국가      지역    Value
5     201903  11     파키스탄  경기 용인시   0.0938
14    201903  11      세네갈  경기 용인시   0.0181
19    201903  11  사우디아라비아  경기 용인시   0.5779
35    201903  11     이탈리아  경기 용인시   0.0633
51    201903  11     루마니아  경기 용인시   0.0285
...      ...  ..      ...     ...      ...
9586  202005  66       중국  경기 용인시  11.7183
9627  202006  66      베트남  경기 용인시   0.0013
9642  202006  66       미국  경기 용인시  27.7205
9645  202006  66       인도  경기 용인시   6.1316
9676  202006  66       홍콩  경기 용인시   4.1862

[2026 rows x 5 columns]

In [31]:
print(data[data['항목'].isin(["11","22","33","44","55","66"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])].shape)

(2026, 5)

In [33]:
data[data['항목'].isin(["11","22","33","44","55","66"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])].tail()

           월  항목   국가      지역    Value
9586  202005  66   중국  경기 용인시  11.7183
9627  202006  66  베트남  경기 용인시   0.0013
9642  202006  66   미국  경기 용인시  27.7205
9645  202006  66   인도  경기 용인시   6.1316
9676  202006  66   홍콩  경기 용인시   4.1862

In [29]:
target_data.head()

Empty DataFrame
Columns: [월, 항목, 국가, 지역, Value]
Index: []

In [34]:
data[data['항목'].isin(["11","22","33","44","55","66"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])].head()

         월  항목       국가      지역   Value
5   201903  11     파키스탄  경기 용인시  0.0938
14  201903  11      세네갈  경기 용인시  0.0181
19  201903  11  사우디아라비아  경기 용인시  0.5779
35  201903  11     이탈리아  경기 용인시  0.0633
51  201903  11     루마니아  경기 용인시  0.0285

In [38]:
target= data[data['항목'].isin(["11","22","33","44","55","66"]) & data['지역'].isin(["강원 춘천시","경기 용인시"])]

In [39]:
target

           월  항목       국가      지역    Value
5     201903  11     파키스탄  경기 용인시   0.0938
14    201903  11      세네갈  경기 용인시   0.0181
19    201903  11  사우디아라비아  경기 용인시   0.5779
35    201903  11     이탈리아  경기 용인시   0.0633
51    201903  11     루마니아  경기 용인시   0.0285
...      ...  ..      ...     ...      ...
9586  202005  66       중국  경기 용인시  11.7183
9627  202006  66      베트남  경기 용인시   0.0013
9642  202006  66       미국  경기 용인시  27.7205
9645  202006  66       인도  경기 용인시   6.1316
9676  202006  66       홍콩  경기 용인시   4.1862

[2026 rows x 5 columns]

In [41]:
print(target.shape)

(2026, 5)

In [42]:
type(target)

pandas.core.frame.DataFrame

In [43]:
sum_Value_by_월_항목_지역=target.groupby(['월','항목','지역']).Value.sum()
print(sum_Value_by_월_항목_지역)

월       항목  지역
201903  11  경기 용인시      6.8593
        22  강원 춘천시    120.9270
            경기 용인시     23.1287
        33  강원 춘천시     20.6387
            경기 용인시      0.7368
                        ...
202006  33  강원 춘천시     48.1646
            경기 용인시      0.5431
        44  경기 용인시      8.8866
        55  경기 용인시      1.0783
        66  경기 용인시     38.0396
Name: Value, Length: 131, dtype: float64

In [44]:
type(sum_Value_by_월_항목_지역)

pandas.core.series.Series

In [ ]:
import numpy as np

In [56]:
print(sum_Value_by_월_항목_지역)

월       항목  지역
201903  11  경기 용인시      6.8593
        22  강원 춘천시    120.9270
            경기 용인시     23.1287
        33  강원 춘천시     20.6387
            경기 용인시      0.7368
                        ...
202006  33  강원 춘천시     48.1646
            경기 용인시      0.5431
        44  경기 용인시      8.8866
        55  경기 용인시      1.0783
        66  경기 용인시     38.0396
Name: Value, Length: 131, dtype: float64

In [46]:
df = sum_Value_by_월_항목_지역.to_frame()

In [47]:
df

                     Value
월      항목 지역
201903 11 경기 용인시    6.8593
       22 강원 춘천시  120.9270
          경기 용인시   23.1287
       33 강원 춘천시   20.6387
          경기 용인시    0.7368
...                    ...
202006 33 강원 춘천시   48.1646
          경기 용인시    0.5431
       44 경기 용인시    8.8866
       55 경기 용인시    1.0783
       66 경기 용인시   38.0396

[131 rows x 1 columns]

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
print(df.shape)

(131, 1)

In [50]:
df['Value']

월       항목  지역
201903  11  경기 용인시      6.8593
        22  강원 춘천시    120.9270
            경기 용인시     23.1287
        33  강원 춘천시     20.6387
            경기 용인시      0.7368
                        ...
202006  33  강원 춘천시     48.1646
            경기 용인시      0.5431
        44  경기 용인시      8.8866
        55  경기 용인시      1.0783
        66  경기 용인시     38.0396
Name: Value, Length: 131, dtype: float64

In [53]:
df['YoY']=df['Value'].groupby(['월','항목','지역']).pct_change(12)
df['MoM']=df['Value'].groupby(['월','항목','지역']).pct_change()

In [54]:
df

                     Value  YoY  MoM
월      항목 지역
201903 11 경기 용인시    6.8593  NaN  NaN
       22 강원 춘천시  120.9270  NaN  NaN
          경기 용인시   23.1287  NaN  NaN
       33 강원 춘천시   20.6387  NaN  NaN
          경기 용인시    0.7368  NaN  NaN
...                    ...  ...  ...
202006 33 강원 춘천시   48.1646  NaN  NaN
          경기 용인시    0.5431  NaN  NaN
       44 경기 용인시    8.8866  NaN  NaN
       55 경기 용인시    1.0783  NaN  NaN
       66 경기 용인시   38.0396  NaN  NaN

[131 rows x 3 columns]

In [55]:
print(df.shape)

(131, 3)

In [58]:
df2= df.reset_index()
df2

          월  항목      지역     Value  YoY  MoM
0    201903  11  경기 용인시    6.8593  NaN  NaN
1    201903  22  강원 춘천시  120.9270  NaN  NaN
2    201903  22  경기 용인시   23.1287  NaN  NaN
3    201903  33  강원 춘천시   20.6387  NaN  NaN
4    201903  33  경기 용인시    0.7368  NaN  NaN
..      ...  ..     ...       ...  ...  ...
126  202006  33  강원 춘천시   48.1646  NaN  NaN
127  202006  33  경기 용인시    0.5431  NaN  NaN
128  202006  44  경기 용인시    8.8866  NaN  NaN
129  202006  55  경기 용인시    1.0783  NaN  NaN
130  202006  66  경기 용인시   38.0396  NaN  NaN

[131 rows x 6 columns]

In [63]:
output=pd.DataFrame ( data={'항목':['11','22','33','44','55','66'],
                            '지역':['강원 춘천시','강원 춘천시','강원 춘천시','경기 용인시','경기 용인시','경기 용인시']}, columns=['항목', '지역'])
output

   항목      지역
0  11  강원 춘천시
1  22  강원 춘천시
2  33  강원 춘천시
3  44  경기 용인시
4  55  경기 용인시
5  66  경기 용인시